page/about.org
#+TITLE: 关于
#+STARTUP: content
#+OPTIONS: toc:nil H:2 num:0 title:nil

“戈楷旎”就是我的英文名"Geekinney"的谐音，没什么特殊的含义。

* 为什么要开设博客？
我本科学习的是计算机专业，作为计算机人，对于 *技术从理论到实践的想象* 从未停止，于是想用学过的技术做点实用的事情。一直有拥有独立博客的想法，正好毕设又学习了Django框架，便开始折腾起来。2019年暑假博客初步建成，使用Django+mysql，后面又改为静态博客，经历了多次改动，详细记录在[[https://blog.geekinney.com/post/experience-of-setting-up-my-own-blog-site.html][记我的博客折腾经历]]这篇文章中。

除了实现对技术的想象，搭建博客更多的是想 *记录自己的成长* 。交流、学习、工作、电影、播客、动漫、文章....我们接触生活的每一种方式都会在脑海中留下大量信息。这些信息进行提炼、联系、再创造就产生了灵感和思考。某些深刻的思考成了我们的生活经验，潜移默化的指导生活；一般的思考留在了我们的记忆中，等待被诉诸文字或言语的机会；而大多数的灵感则在片刻停留后，销声匿迹。我的博客要记录那些 =于生活有益的经验，于工作有助的思考，于无声处作用的灵感= ，这些便是是成长的印记。
