about.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-03-02 Mon 21:05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>关于</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kinney Zhang">

<link rel="shortcut icon" href="/static/img/favicon.ico"/>
<link rel="bookmark" href="/static/img/favicon.ico" type="image/x-icon"/>
<link id="pagestyle" rel="stylesheet" type="text/css" href="/static/light.css"/>
<!-- Google Analytics -->
<!-- End Google Analytics -->
</head>
<body>

<div id="org-div-header">
<div class="toptitle">
<a id="logo" href="/index.html">戈楷旎</a>
<p class="description">happy hacking emacs!</p>
</div>
<div class="topnav">
<a href="/index.html">首页</a>&nbsp;&nbsp;
<a href="/archive.html">归档</a>&nbsp;&nbsp;
<a href="/category.html">分类</a>&nbsp;&nbsp;
<a href="/bookmark.html">书签</a>&nbsp;&nbsp;
<a href="/friendly-link.html">友链</a>&nbsp;&nbsp;
<a href="/message.html">留言</a>&nbsp;&nbsp;
<a href="https://github.com/Kinneyzhang">Github</a>&nbsp;
</div>
</div><div id="content">
<p>
“戈楷旎”就是我的英文名"Geekinney"的谐音，没什么特殊的含义。
</p>

<div id="outline-container-org6109a57" class="outline-2">
<h2 id="org6109a57">为什么要开设博客？</h2>
<div class="outline-text-2" id="text-org6109a57">
<p>
我本科学习的是计算机专业，作为计算机人，对于 <b>技术从理论到实践的想象</b> 从未停止，于是想用学过的技术做点实用的事情。一直有拥有独立博客的想法，正好毕设又学习了Django框架，便开始折腾起来。2019年暑假博客初步建成，使用Django+mysql，后面又改为静态博客，经历了多次改动，详细记录在<a href="https://blog.geekinney.com/post/experience-of-setting-up-my-own-blog-site.html">记我的博客折腾经历</a>这篇文章中。
</p>

<p>
除了实现对技术的想象，搭建博客更多的是想 <b>记录自己的成长</b> 。交流、学习、工作、电影、播客、动漫、文章&#x2026;.我们接触生活的每一种方式都会在脑海中留下大量信息。这些信息进行提炼、联系、再创造就产生了灵感和思考。某些深刻的思考成了我们的生活经验，潜移默化的指导生活；一般的思考留在了我们的记忆中，等待被诉诸文字或言语的机会；而大多数的灵感则在片刻停留后，销声匿迹。我的博客要记录那些 <code>于生活有益的经验，于工作有助的思考，于无声处作用的灵感</code> ，这些便是是成长的印记。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<script src="/static/jQuery.min.js"></script>

<p class="author">Author: Kinney Zhang (<a href="mailto:kinneyzhang666@gmail.com">kinneyzhang666@gmail.com</a>)</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>


<script>
$(document).ready(function(){
var theme = sessionStorage.getItem("theme");
if(theme=="dark"){
document.getElementById("pagestyle").href="/static/dark.css";
}else if(theme=="light"){
document.getElementById("pagestyle").href="/static/light.css";
}else{
sessionStorage.setItem("theme","light");
}});

function switchTheme(){
if(sessionStorage.getItem("flag")=="false"){
document.getElementById("pagestyle").href="/static/light.css";
sessionStorage.setItem("theme","light");
sessionStorage.setItem("flag", "true");
}else{
document.getElementById("pagestyle").href="/static/dark.css";
sessionStorage.setItem("theme","dark");
sessionStorage.setItem("flag", "false");
}};
</script>
</div>
</body>
</html>
